app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        DB::beginTransaction();
        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);

        try {
            event(new Registered($user));

            $customer = new Customer();
            $names = explode(" ", $user->name);
            $customer->user_id = $user->id;
            $customer->first_name = $names[0];
            $customer->last_name = $names[1] ?? '';
            $customer->save();
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('testing satu', 'testing1@example.com', '$2y$10$dltVvYaSgsVwBzTfWqsBmO1eMSbqfOpRGr4HV/V.2wPhCwPw7rHO6', '2023-12-16 09:21:32', '2023-12-16 09:21:32')
insert into `customers` (`user_id`, `first_name`, `last_name`, `updated_at`, `created_at`) values (4, 'testing', 'satu', '2023-12-16 09:21:37', '2023-12-16 09:21:37')