app/Http/Controllers/Auth/VerifyEmailController.php

    public function __invoke(EmailVerificationRequest $request): RedirectResponse
    {
        if ($request->user()->hasVerifiedEmail()) {
            return redirect()->intended(RouteServiceProvider::HOME.'?verified=1');
        }

        if ($request->user()->markEmailAsVerified()) {
            $customer = $request->user()->customer;
            $customer->status = CustomerStatus::Active->value;
            $customer->save();
---
update `customers` set `status` = 'active', `customers`.`updated_at` = '2023-12-16 08:52:33' where `user_id` = 2