app/Http/Controllers/Api/CategoryController.php

select `id`, `name` from `categories` where `categories`.`deleted_at` is null
---
    public function getOptionCategory()
    {
        // You might want to apply some filtering, searching, or pagination here.
        // For simplicity, I'll fetch all categories.
        $categories = Category::all(['id', 'code', 'name', 'updated_at']);

select * from `categories` where (`code` like '%%' or `name` like '%%') and `categories`.`deleted_at` is null order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `categories` where (`code` like '%%' or `name` like '%%') and `categories`.`deleted_at` is null
---
    public function index()
    {
        $search = request('search', false);
        $perPage = request('per_page', 10);
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Category::query();
        $query->orderBy($sortField, $sortDirection);
        if($search) {
            $query->where('code', 'like', "%{$search}%")
            ->orWhere('name', 'like', "%{$search}%");
        }
        return CategoryListResource::collection($query->paginate($perPage));

insert into `categories` (`code`, `name`, `description`, `created_by`, `updated_by`, `slug`, `updated_at`, `created_at`) values ('ks', 'kategori1', '', 1, 1, 'kategori1', '2023-12-17 04:19:25', '2023-12-17 04:19:25')
---
    public function store(CategoryRequest $request)
    {
        // return new CategoryResource(Category::create($request->validated()));
        $data = $request->validated();
        $data['created_by'] = $request->user()->id;
        $data['updated_by'] = $request->user()->id;

        $category = Category::create($data);

select count(*) as aggregate from `types` where `types`.`category_id` = 31 and `types`.`category_id` is not null and `types`.`deleted_at` is null
update `categories` set `deleted_at` = '2023-12-17 11:51:45', `categories`.`updated_at` = '2023-12-17 11:51:45' where `id` = 31
---
    public function destroy(Category $category)
    {
        // Cek jika kategori memiliki tipe
        if ($category->type()->count() > 0) {
            // Lempar Exception dengan pesan error
            throw new \Exception("Kategori ini memiliki tipe terkait dan tidak dapat dihapus.");
            // return response()->json(['error' => 'Kategori ini memiliki tipe terkait dan tidak dapat dihapus.'], 409);
        }

        $category->delete();