app/Http/Controllers/Api/CustomerController.php

select * from `customers` order by `customers`.`updated_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (2, 4)
select count(*) as aggregate from `customers`
---
    public function index()
    {
        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Customer::query()
            ->with('user')
            ->orderBy("customers.$sortField", $sortDirection);
        if($search) {
            $query
                ->where(DB::raw("CONCAT(first_name, ' ', last_name)"), 'like', "%{$search}%")
                ->join('users', 'customers.user_id', '=', 'users.id')
                ->orWhere('users.email', 'like', "%{$search}%")
                ->orWhere('customers.phone', 'like', "%{$search}%");
        }
        $paginator = $query->paginate($perPage);

update `customers` set `phone` = '0821231422', `status` = 'disabled', `customers`.`updated_at` = '2023-12-16 10:05:59' where `user_id` = 4
insert into `customer_addresses` (`address1`, `address2`, `city`, `state`, `zipcode`, `country`, `customer_id`, `type`, `updated_at`, `created_at`) values ('alamata', 'alamats', 'kota', 'jatim', '23112', 'Indonesia', 4, 'shipping', '2023-12-16 10:05:59', '2023-12-16 10:05:59')
insert into `customer_addresses` (`address1`, `address2`, `city`, `state`, `zipcode`, `country`, `customer_id`, `type`, `updated_at`, `created_at`) values ('alamat', 'alamat', 'kota', 'jatim', '23112', 'Indonesia', 4, 'billing', '2023-12-16 10:05:59', '2023-12-16 10:05:59')
---
    public function update(CustomerRequest $request, Customer $customer)
    {
        $customerData = $request->validated();
        $customerData['updated_by'] = $request->user()->id;
        $customerData['status'] = $customerData['status']?CustomerStatus::Active->value:CustomerStatus::Disabled->value;

        $shippingData = $customerData['shippingAddress'];
        $billingData = $customerData['billingAddress'];

        DB::beginTransaction();
        try {
            $customer->update($customerData);

            if($customer->shippingAddress) {
                $customer->shippingAddress->update($shippingData);
            } else {
                $shippingData['customer_id'] = $customer->user_id;
                $shippingData['type'] = AddressType::Shipping->value;
                CustomerAddress::create($shippingData);
            }

            // throw new \Exception('test');
            if($customer->billingAddress) {
                $customer->billingAddress->update($billingData);
            } else {
                $billingData['customer_id'] = $customer->user_id;
                $billingData['type'] = AddressType::Billing->value;
                CustomerAddress::create($billingData);