app/Http/Controllers/Api/DashboardController.php

    public function activeCustomers()
    {
        return Customer::where('status', CustomerStatus::Active->value)->count();
---
select count(*) as aggregate from `customers` where `status` = 'active'

    public function activeProducts()
    {
        // TODO Implement where for active products
        return Product::where('published', '=', 1)->count();
---
select count(*) as aggregate from `products` where `published` = 1 and `products`.`deleted_at` is null

    public function paidOrders()
    {
        $fromDate = $this->getFromDate();
        $query = Order::query()->where('status', OrderStatus::Paid->value);

        if($fromDate) {
            $query->where('created_at', '>', $fromDate);
        }

        return $query->count();
---
select count(*) as aggregate from `orders` where `status` = 'paid'

    public function totalIncome()
    {
        $fromDate = $this->getFromDate();
        $query = Order::query()->where('status', OrderStatus::Paid->value);

        if($fromDate) {
            $query->where('created_at', '>', $fromDate);
        }

        return $query->sum('total_price');
---
select sum(`total_price`) as aggregate from `orders` where `status` = 'paid'

    public function latestCustomers()
    {
        return Customer::query()
            ->select(['id', 'first_name', 'last_name', 'u.email', 'phone', 'u.created_at'])
            ->join('users AS u', 'u.id', '=', 'customers.user_id')
            ->where('status', CustomerStatus::Active->value)
            ->orderBy('created_at', 'desc')
            ->limit(5)
            ->get();
---
select `id`, `first_name`, `last_name`, `u`.`email`, `phone`, `u`.`created_at` from `customers` inner join `users` as `u` on `u`.`id` = `customers`.`user_id` where `status` = 'active' order by `created_at` desc limit 5

    public function latestOrders() {
        return OrderResource::collection(
            Order::query()
                ->select(['o.id', 'o.total_price', 'o.created_at', DB::raw('COUNT(oi.id) AS items'), 'c.user_id', 'c.first_name', 'c.last_name'])
                ->from('orders AS o')
                ->join('order_items AS oi', 'oi.order_id', '=', 'o.id')
                ->join('customers AS c', 'c.user_id', '=', 'o.created_by')
                ->where('o.status', OrderStatus::Paid->value)
                ->limit(10)
                ->orderBy('o.created_at', 'desc')
                ->groupBy('o.id', 'o.total_price', 'o.created_at', 'c.user_id', 'c.first_name', 'c.last_name')
                ->get()
        );
---
select `o`.`id`, `o`.`total_price`, `o`.`created_at`, COUNT(oi.id) AS items, `c`.`user_id`, `c`.`first_name`, `c`.`last_name` from `orders` as `o` inner join `order_items` as `oi` on `oi`.`order_id` = `o`.`id` inner join `customers` as `c` on `c`.`user_id` = `o`.`created_by` where `o`.`status` = 'paid' group by `o`.`id`, `o`.`total_price`, `o`.`created_at`, `c`.`user_id`, `c`.`first_name`, `c`.`last_name` order by `o`.`created_at` desc limit 10