app/Http/Controllers/Api/OrderController.php

    public function view(Order $order)
    {
        $order->load('items.product');
---
select * from `products` where `products`.`id` in (23, 35) and `products`.`deleted_at` is null