app/Http/Controllers/Api/TypeController.php

select * from `types` where `types`.`deleted_at` is null order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `types` where `types`.`deleted_at` is null
---
    public function index()
    {
        // return TypeListResource::collection(Type::query()->paginate(10));
        $search = request('search', false);
        $perPage = request('per_page', 10);
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Type::query();
        $query->orderBy($sortField, $sortDirection);
        if($search) {
            $query->where('code', 'like', "%{$search}%")
            ->orWhere('name', 'like', "%{$search}%");
        }

        return TypeListResource::collection($query->paginate($perPage));