app/Http/Controllers/Api/UserController.php

    public function index()
    {
        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = User::query()
            ->orderBy($sortField, $sortDirection)
            ->paginate($perPage);
---
select * from `users` order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `users`