app/View/Components/AppLayout.php

select * from `categories` where exists (select * from `types` where `categories`.`id` = `types`.`category_id` and exists (select * from `products` where `types`.`id` = `products`.`type_id` and `products`.`deleted_at` is null) and `types`.`deleted_at` is null) and `categories`.`deleted_at` is null
select * from `products` where `products`.`type_id` in (1, 2, 3, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 37, 38, 39) and `products`.`deleted_at` is null
select * from `types` where `types`.`category_id` in (3, 4, 5, 6, 11, 12, 13, 15, 16, 18, 19, 20, 22, 25, 26, 28, 29, 30) and `types`.`deleted_at` is null
select * from `image_sources` where `id` in (1, 2, 3, 4, 5, 6, 7)
select `categories`.`id`, `categories`.`name`, `categories`.`slug`, COALESCE(SUM(order_items.quantity), 0) as total_quantity from `categories` left join `types` on `categories`.`id` = `types`.`category_id` left join `products` on `types`.`id` = `products`.`type_id` left join `order_items` on `products`.`id` = `order_items`.`product_id` left join `orders` on `order_items`.`order_id` = `orders`.`id` and `orders`.`status` = 'Paid' where `categories`.`deleted_at` is null group by `categories`.`id`, `categories`.`name`, `categories`.`slug` order by `total_quantity` desc limit 5
select * from `social_media` where `name` is not null and `link` is not null and `social_media`.`deleted_at` is null
select * from `information_companies` where `id` = 1
---
    public function render(): View
    {
        $categories = Category::whereHas('type.product')->with('type.product')->get();
        foreach ($categories as $category) {
            foreach ($category->type as $type) {
                $type->setRelation('product', $type->product->take(1));
            }
        }
        // $menu = array();
        $menu = $categories;

        $headerImage = ImageSource::whereIn('id', [1, 2, 3, 4, 5, 6, 7])->get();
        $headerImages = [];
        foreach ($headerImage as $image) {
            if ($image->image != '') {
                $headerImages[] = $image;
            } else {
                $image->image = asset('images/product_default.png');
                $headerImages[] = $image;

            }
        }
            // dump($headerImage);

        $categories = null;
        $categories = Category::select('categories.id', 'categories.name', 'categories.slug')
            ->selectRaw('COALESCE(SUM(order_items.quantity), 0) as total_quantity')
            ->leftJoin('types', 'categories.id', '=', 'types.category_id')
            ->leftJoin('products', 'types.id', '=', 'products.type_id')
            ->leftJoin('order_items', 'products.id', '=', 'order_items.product_id')
            ->leftJoin('orders', function ($join) {
                $join->on('order_items.order_id', '=', 'orders.id')
                    ->where('orders.status', 'Paid');
            })
            ->groupBy('categories.id', 'categories.name', 'categories.slug')
            ->orderBy('total_quantity', 'DESC')
            ->limit(5)
            ->get();


        // Social Media
        $socialMedias = SocialMedia::whereNotNull('name')
            ->whereNotNull('link')
            ->get();

        $informationCompany = InformationCompany::where('id', 1)->get();