app/Helpers/Cart.php

select sum(`quantity`) as aggregate from `cart_items` where `user_id` = 2
---
    public static function getCartItemsCount(): int
    {
        $request = \request();
        $user = $request->user();
        if($user) {
            return CartItem::where('user_id', $user->id)->sum('quantity');

select * from `cart_items` where `user_id` = 5
---
    public static function getCartItems()
    {
        $request = \request();
        $user = $request->user();
        if($user) {
            return CartItem::where('user_id', $user->id)->get()->map(
                fn($item) => ['product_id' => $item->product_id, 'quantity' => $item->quantity]
            );

select * from `cart_items` where (`user_id` = 4)
---
    public static function moveCartItemsIntoDb()
    {
        $request = \request();
        $cartItems = self::getCookieCartItems();
        $dbCartItems = CartItem::where(['user_id' => $request->user()->id])->get()->keyBy('product_id');

select * from `products` where `id` in (41) and `products`.`deleted_at` is null
---
    public static function getProductsAndCartItems(): array|\Illuminate\Database\Eloquent\Collection
    // public static function getProductAndCartItems()
    {
        $cartItems = self::getCartItems();

        $ids = Arr::pluck($cartItems, 'product_id');
        $products = Product::query()->whereIn('id', $ids)->get();