app/Helpers/FilterHelper.php

    public static function getMaterialsAndColors() {
        return [
            'materials' => Material::orderBy('name', 'asc')->get(['id', 'name']),
            'colors' => Color::orderBy('name', 'asc')->get(['id', 'name']),
        ];
---
select `id`, `name` from `materials` where `materials`.`deleted_at` is null order by `name` asc
select `id`, `name` from `colors` where `colors`.`deleted_at` is null order by `name` asc