app/Http/Controllers/CartController.php

select * from `cart_items` where (`user_id` = 5 and `product_id` = 41) limit 1
insert into `cart_items` (`user_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (5, 41, '12', '2023-12-17 11:08:22', '2023-12-17 11:08:22')
---
    public function add(Request $request, Product $product)
    {
        $quantity = $request->post('quantity', 1);
        $user = $request->user();
        if($user) {
            $cartItem = CartItem::where(['user_id' => $user->id, 'product_id' => $product->id])->first();
            if ($cartItem) {
                $cartItem->quantity += $quantity;
                $cartItem->update();
            } else {
                $data = [
                    'user_id' => $request->user()->id,
                    'product_id' => $product->id,
                    'quantity' => $quantity,
                ];
                CartItem::create($data);