app/Http/Controllers/CategoryController.php

select `products`.*, `types`.`category_id` as `laravel_through_key` from `products` inner join `types` on `types`.`id` = `products`.`type_id` where `types`.`category_id` = 4 and `products`.`deleted_at` is null and `types`.`deleted_at` is null order by `updated_at` desc limit 40 offset 0
select count(*) as aggregate from `products` inner join `types` on `types`.`id` = `products`.`type_id` where `types`.`category_id` = 4 and `products`.`deleted_at` is null and `types`.`deleted_at` is null
---
    public function index(Request $request, Category $category) {
        $materialIds = json_decode($request->cookie('material_ids', '[]'), true);
        $colorIds = json_decode($request->cookie('color_ids', '[]'), true);

        // var_dump($materialIds);
        // var_dump($category);
        // exit;

        $query = $category->product();
        // if ($materialIds) {
        //     $query->whereIn('material_id', $materialIds);
        // }
        // if ($colorIds) {
        //     $query->whereIn('color_id', $colorIds);
        // }
        $query = FilterHelper::applyMaterialAndColorFilters($query, $materialIds, $colorIds);
        $products = $query->orderBy('updated_at', 'desc')->paginate(40);