app/Http/Controllers/DashboardController.php

select * from `image_sources` where `id` = 8
select * from `image_sources` where `id` in (9, 10, 11, 12, 13, 14)
---
    public function index(Request $request) {

        $categoriesShop = Category::getShopByCategory(5)->get();
        $prodoctsTopSell = Product::getTopSellingProducts(4)->get();

        $sectionImage = ImageSource::where('id', 8)->get();
        $sectionImages = [];
        foreach ($sectionImage as $image) {
            if ($image->image != '') {
                $sectionImages[] = $image;
            } else {
                $image->image = asset('images/featured_image_default.png');
                $sectionImages[] = $image;

            }
        }

        $footerImage = ImageSource::whereIn('id', [9, 10, 11, 12, 13, 14])->get();