app/Http/Controllers/ProfileController.php

    public function update(ProfileUpdateRequest $request): RedirectResponse
    {
        $customerData = $request->validated();
        $shippingData = $customerData['shipping'];
        $billingData = $customerData['billing'];

        /** @var \App\Models\User $user */
        $user = $request->user();
        /** @var \App\Models\Customer $customer */
        $customer = $user->customer;

        $user->fill($customerData);
        if ($user->isDirty('email')) {
            $user->email_verified_at = null;
        }

        $user->save();

        DB::beginTransaction();
        try {
            $customer->update($customerData);

            if($customer->shippingAddress) {
                $customer->shippingAddress->update($shippingData);
            } else {
                $shippingData['customer_id'] = $customer->user_id;
                $shippingData['type'] = AddressType::Shipping->value;
                CustomerAddress::create($shippingData);
---
update `customers` set `phone` = '082130600391', `customers`.`updated_at` = '2023-12-16 08:53:37' where `user_id` = 2
insert into `customer_addresses` (`address1`, `address2`, `city`, `state`, `zipcode`, `country`, `customer_id`, `type`, `updated_at`, `created_at`) values ('alamat1', 'alamat2', 'kota', 'prov', '12352', 'Indonesia', 2, 'shipping', '2023-12-16 08:53:37', '2023-12-16 08:53:37')

            } else {
                $billingData['customer_id'] = $customer->user_id;
                $billingData['type'] = AddressType::Billing->value;
                CustomerAddress::create($billingData);
---
insert into `customer_addresses` (`address1`, `address2`, `city`, `state`, `zipcode`, `country`, `customer_id`, `type`, `updated_at`, `created_at`) values ('alamat1', 'alamat2', 'kota', 'prov', '12352', 'Indonesia', 2, 'billing', '2023-12-16 08:53:37', '2023-12-16 08:53:37')