app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        Schema::defaultStringLength(191);

        View::composer('components.application-logo', function ($view) {
            $logo = InformationCompany::where('id', 1)->value('image');
            if (!$logo) {
                $logo = asset('images/logo_default.png');
            }
            $view->with('logo', $logo);
        });
---
select `image` from `information_companies` where `id` = 1 limit 1